/*
描述：
作为大一卷王的小鹏，早早的就参加了比赛并获得了奖项，这些奖项可以帮助小鹏申请奖学金，提升综测分数，有助于小鹏考研或者就业。
已知小鹏获得了n个奖项(0 <= n < 10)，每个奖项加分为ai(0 < ai < 15)，
综测加分最后会乘以0.3，现在到了计算综测加分的时候了，请你计算出小鹏总的加分(答案保留两位小数)。
输入描述：
第一行输入一个整数n(0 <= n < 10)
第二行输入n个浮点数，表示第i个奖项的综测得分
输出描述：
输出一个浮点数，表示小鹏的最终加分。
输入
4
8.5 12 4.5 9.5
输出：
10.35
说明：
(8.5 + 12 + 4.5 + 9.5) * 0.3 = 10.35
备注：
0 <= n < 10
0 < ai < 15
答案误差在0.01以内都被认为是正确答案
*/
#include <iostream>
using namespace std;

int main(){
    int n;
    double sum;
    cin >> n;
    if(n >= 0 && n <10){
        for(int i = 0;i < n;i++){
            double ai;
            cin >> ai;
            if(ai > 0 && ai < 15){
                sum += ai;
            }else{
                return 0;
            }
        }   
    }else{
        return 0;
    }
    printf("%.2lf",sum * 0.3);
}
————————————————————————————————————————————————————————————————————————————————
//标准答案（有问题）
#include<stdio.h>
int main()
{
	int n = 0;
	double ans = 0, temp = 0;
	scanf("%d", &n);
	for (int i = 0; i < n; i++) 
	{
		scanf("%lf", &temp);
		ans += temp;
	}
	printf("%.2f\n", ans * 0.3);
	return 0;
}
